app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "raj3@raj.com"], ["password_digest", "rajraj"], ["created_at", "2021-10-21 04:08:56.945612"], ["updated_at", "2021-10-21 04:08:56.945612"]]
---
  def create
    @user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "raj1@raj.com"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by(email: params[:email])